#include<iostream>

//Задача 1:
void printSumFromFile(const char* fileName){
    // Създайте предвително текстов файл, 
    // съдържащ 2 цели числа, разделени с
    // интервал (на един ред)
    //TO DO
}

//Задача 2:
unsigned findMaxNumFromFile(const char* file) {
    // Създайте предвително текстов файл, 
    // съдържащ няколко цели числа, разделени
    // с интервал (на един ред)
    //TO DO
}

//Задача 3:
unsigned getLinesCount(const char* fileName){
    //TO DO
    // Упътване: Използвайте допълнителна функция
}

int main(){
    //printSumFromFile("sum.txt");
    //std::cout<< findMaxNumFromFile("maxNumber.txt") <<std::endl;
}